import personal from "../assets/personal.jpg";
import cake1 from "../assets/cake1.jpg";
import cake4 from "../assets/cake4.jpg";
import cake6 from "../assets/cake6.jpg";
import cake5 from "../assets/cake5.jpg";
import cake2 from "../assets/cake2.jpg";
import cake10 from "../assets/cake10.jpg";
import cake3 from "../assets/cake3.jpg";
import cake7 from "../assets/cake7.jpg";
import cake9 from "../assets/cake9.jpg";
import cake11 from "../assets/cake11.jpg";
import cake12 from "../assets/cake12.jpg";
import cake8 from "../assets/cake8.jpg";

const cakes = [
    {
        label: "Индивидуальный дизайн",
        image: personal,
        title: "Ваш торт мечты",
        size: "🤍 ярусов 🤍 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 15-20 гостей - \n" +
            "12 699 ₽",
            "На 25-30 гостей-\n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽"
        ],
    },
    {
        label: "Хит",
        image: cake1,
        title: "Свадебный торт",
        size: "6 яруса 90 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 15-20 гостей - \n" +
            "12 699 ₽",
            "На 25-30 гостей-\n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽"
        ],
    },
    {
        label: "Классика",
        image: cake4,
        title: "Свадебный торт",
        size: "7 ярусов 110 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "16 599 ₽",
            "На 35-40 гостей-\n" +
            "21 699 ₽",
            "На 45-50 гостей-\n" +
            "28 700 ₽"
        ],
    },
    {
        label: "Новинка",
        image: cake6,
        title: "Свадебный торт",
        size: "6 ярусов 90 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "16 599 ₽",
            "На 35-40 гостей-\n" +
            "21 699 ₽",
            "На 45-50 гостей-\n" +
            "28 700 ₽"
        ],
    },
    {
        label: "",
        image: cake5,
        title: "Свадебный торт",
        size: "6 ярусов 90 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "16 599 ₽",
            "На 35-40 гостей-\n" +
            "21 699 ₽",
            "На 45-50 гостей-\n" +
            "28 700 ₽"
        ],
    },
    {
        label: "",
        image: cake2,
        title: "Свадебный торт",
        size: "5 ярусов 90 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake10,
        title: "Торт на корпоратив",
        size: "4 яруса 70 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake3,
        title: "Торт на юбилей",
        size: "4 яруса 70 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "16 599 ₽",
            "На 35-40 гостей-\n" +
            "21 699 ₽",
            "На 45-50 гостей-\n" +
            "28 700 ₽"
        ],
    },
    {
        label: "",
        image: cake7,
        title: "Торт на юбилей",
        size: "4 яруса 60 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake9,
        title: "Свадебный торт",
        size: "5 ярусов 90 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake11,
        title: "Торт на День Рождения",
        size: "6 ярусов 100 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake12,
        title: "Торт на выпускной",
        size: "6 ярусов 100 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },
    {
        label: "",
        image: cake8,
        title: "Торт на День Рождения",
        size: "5 ярусов 80 см от 5 кг",
        price: "от 2 500 ₽ кг",
        desc: [
            "На 25-30 гостей - \n" +
            "17 899 ₽",
            "На 35-40 гостей-\n" +
            "22 499 ₽",
            "На 45-50 гостей-\n" +
            "29 999 ₽"
        ],
    },

];

export default cakes;