const faqItems = [
    {
        question: "Как заказать торт?",
        answer: [
            "Вы можете оформить заказ через наш сайт, написав нам " +
            "в WhatsApp или Telegram, либо позвонив по телефону. " +
            "Мы обсудим все детали и поможем выбрать идеальный вариант."
        ]
    },
    {
        question: "За сколько дней нужно заказывать торт?",
        answer: [
            "Рекомендуем делать заказ минимум за 7 дней для торта с лаконичным дизайном. ",
            "Для тортов с оригинальным декором — за 14 дней до начала мероприятия. ",
            "Как правило, линейка заказов в нашей кондитерской полностью сформирована на 1-2 месяца вперед," +
            " а свадебные торты часто заказывают за 3 месяцев до даты торжества."
            ]
    },
    {
        question: "Какая информация необходима для того, чтобы сделать заказ?",
        answer: [
            "При обращении в Cake de Luxe, в преддверии личной встречи с персональным " +
            "менеджером, каждому клиенту мы задаем список из семи базовых вопросов:",
"• Какое важное событие вы празднуете?",
"• Дата праздника?",
"• Количество гостей?",
            "• Место проведения праздника?",
            "• Какова будет флористика и/или цветовая гамма декора?",
            "• Есть ли особые элементы декора, которые вам очень дороги в рамках " +
            "этого праздника?",
            "• Есть ли определенный бюджет на торт, рамок которого " +
            "нам необходимо придерживаться?"
            ]
    },
    {
        question: "Сколько стоит ваш торт?",
        answer: [
            "Есть минимальная стоимость за килограмм - от 2500 рублей. А дальше все зависит от сложности дизайна, сроков исполнения и вашего воображения.",
            "Наши возможности практически безграничны.",
            "В Cake de Luxe не существует готовой коллекции тортов. Каждый дизайн создается индивидуально для вашего праздника. И чем более сложный дизайн, тем больше времени нашей команды потребует его реализация.",
            "При проработке эскиза мы оцениваем количество рабочих часов, которое потребует именно ваш торт. Из этого и складывается его финальная стоимость. И зачастую большой лаконичный торт может стоит дешевле небольшого, но богато украшенного деталями."
            ]
    },
    {
        question: "Какова стоимость доставки торта?",
        answer: [
            "Стоимость доставки складывается из разных факторов:",
            "• Время доставки",
            "• Местоположение торжества",
            "• Выезд кондитера"
            ]
    },
    {
        question: "Мне в журнале  понравился свадебный торт на 200 человек. На моей свадьбе будет 45 человек гостей. Можете ли вы сделать  торт из журнала, но только на 45 человек?",
        answer: [
            "Наша команда обладает техническими возможностями воссоздать " +
            "торт для 45 человек даже если его референс был изготовлен для 200!"
        ]
    },
    {
        question: "Когда к вам можно прийти на дегустацию? " +
            "Работаете ли вы вечером/в выходные/в праздники?",
        answer: [
            "Мы будем рады организовать встречу с личным менеджером и дегустацию " +
            "торта в удобный для вас день и время по предварительной договоренности."
        ]
    },
];

export default faqItems;