import filling1 from "../assets/filling1.jpg";
import filling2 from "../assets/filling2.jpg";
import filling3 from "../assets/filling3.jpg";
import filling4 from "../assets/filling4.jpg";
import filling5 from "../assets/filling5.jpg";
import filling6 from "../assets/filling6.jpg";


const fillings = [
    {
        image: filling1,
        title: "Ягодная Мелодия Любви",
        desc: "Погрузитесь в мир романтики и нежности с нашей эксклюзивной начинкой" +
            " \"Ягодная Мелодия Любви\". Этот изысканный торт станет идеальным " +
            "украшением вашего свадебного стола и подарит незабываемые моменты радости.",
        composition: [
            "Ванильный бисквит",
            "Крем чиз",
            "Ягодная начинка на выбор (клубника, смородина, облепиха)"
        ]
    },
    {
        image: filling2,
        title: "Шоколадная Симфония с Вишневыми Аккордами",
        desc: "Откройте для себя волшебство сладкого наслаждения с нашей начинкой " +
            "\"Шоколадная Симфония с Вишневыми Аккордами\". Эта начинка — идеальный выбор " +
            "для тех, кто хочет добавить в свой свадебный день нотку страсти и изысканности.",
        composition: [
            "Шоколадный бисквит",
            "Крем чиз",
            "Натуральная вишня"
        ]
    },
    {
        image: filling3,
        title: "Персиковый Вальс Счастья",
        desc: "Погрузитесь в атмосферу нежности и счастья с нашей начинкой " +
            "\"Персиковый Вальс Счастья\". Эта начинка станет идеальным акцентом вашего " +
            "свадебного торжества, наполняя его светом, радостью и изысканным вкусом.",
        composition: [
            "Ванильный бисквит",
            "Крем чиз",
            "Кусочки персика"
        ]
    },
    {
        image: filling4,
        title: "Малиновый бархат",
        composition: [
            "Шоколадный бисквит бордового цвета",
            "Крем чиз",
            "Малиновое конфи"
        ]
    },
    {
        image: filling5,
        title: "Молочная девочка с фруктовой начинкой",
        composition: [
            "Бисквит на сгущенке",
            "Сливочно-фруктовый крем",
            "фруктовая начинка на выбор (персики, ананасы, киви)"
        ]
    },
    {
        image: filling6,
        title: "Торт OREO",
        composition: [
            "Шоколадный бисквит",
            "Крем чиз",
            "Печенье ОРЕО"
        ]
    },
];


export default fillings;